{"config": [{"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "dtype": "float32", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32, 32, 3], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 512, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"seed": null, "name": "dropout_3", "noise_shape": null, "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 10, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow"}